; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-7-7-34)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p0-1 - location
	p0-2 - location
	p0-3 - location
	p1-0 - location
	p1-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s2)
	(at driver3 s3)
	(at driver4 s2)
	(at driver5 s2)
	(at driver6 s3)
	(at driver7 s3)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s1)
	(empty truck5)
	(at truck6 s2)
	(empty truck6)
	(at truck7 s2)
	(empty truck7)
	(at package1 s1)
	(at package2 s2)
	(at package3 s0)
	(at package4 s0)
	(at package5 s1)
	(at package6 s2)
	(at package7 s1)
	(at package8 s3)
	(at package9 s0)
	(at package10 s1)
	(at package11 s0)
	(at package12 s0)
	(at package13 s0)
	(at package14 s3)
	(at package15 s2)
	(at package16 s3)
	(at package17 s3)
	(at package18 s2)
	(at package19 s1)
	(at package20 s3)
	(at package21 s1)
	(at package22 s3)
	(at package23 s3)
	(at package24 s3)
	(at package25 s2)
	(at package26 s3)
	(at package27 s3)
	(at package28 s3)
	(at package29 s0)
	(at package30 s0)
	(at package31 s3)
	(at package32 s2)
	(at package33 s2)
	(at package34 s2)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s0 s3)
	(link s3 s0)
	(link s2 s3)
	(link s3 s2)
	(link s3 s1)
	(link s1 s3)
)
	(:goal (and
	(at driver3 s0)
	(at driver4 s1)
	(at driver6 s0)
	(at driver7 s2)
	(at truck2 s1)
	(at truck3 s3)
	(at truck4 s1)
	(at truck6 s0)
	(at truck7 s2)
	(at package2 s0)
	(at package3 s0)
	(at package4 s3)
	(at package5 s1)
	(at package6 s3)
	(at package7 s3)
	(at package8 s1)
	(at package9 s3)
	(at package10 s2)
	(at package11 s3)
	(at package12 s2)
	(at package13 s2)
	(at package14 s2)
	(at package15 s0)
	(at package17 s0)
	(at package18 s3)
	(at package19 s3)
	(at package20 s1)
	(at package21 s1)
	(at package22 s1)
	(at package23 s2)
	(at package24 s1)
	(at package25 s3)
	(at package26 s3)
	(at package27 s2)
	(at package28 s1)
	(at package29 s2)
	(at package30 s1)
	(at package31 s3)
	(at package32 s3)
	(at package33 s2)
	(at package34 s1)
	))


)

; plan
1. (board-truck driver2 s2 truck1)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 7 of 41
2. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 7 of 41
3. (drive-truck driver2 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 7 of 41
4. (load-truck s3 package8 truck1)
   deleted: (at package8 s3)
   added: (in package8 truck1)
   goals met: 7 of 41
5. (load-truck s3 package28 truck1)
   deleted: (at package28 s3)
   added: (in package28 truck1)
   goals met: 7 of 41
6. (drive-truck driver2 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 7 of 41
7. (load-truck s0 package9 truck1)
   deleted: (at package9 s0)
   added: (in package9 truck1)
   goals met: 7 of 41
8. (drive-truck driver2 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 7 of 41
9. (unload-truck s3 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s3)
   goals met: 8 of 41
10. (load-truck s3 package27 truck1)
   deleted: (at package27 s3)
   added: (in package27 truck1)
   goals met: 8 of 41
11. (drive-truck driver2 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 8 of 41
12. (load-truck s0 package4 truck1)
   deleted: (at package4 s0)
   added: (in package4 truck1)
   goals met: 8 of 41
13. (drive-truck driver2 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 8 of 41
14. (unload-truck s3 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s3)
   goals met: 9 of 41
15. (load-truck s3 package24 truck1)
   deleted: (at package24 s3)
   added: (in package24 truck1)
   goals met: 9 of 41
16. (drive-truck driver2 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 9 of 41
17. (load-truck s0 package30 truck1)
   deleted: (at package30 s0)
   added: (in package30 truck1)
   goals met: 9 of 41
18. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 9 of 41
19. (unload-truck s1 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s1)
   goals met: 10 of 41
20. (load-truck s1 package7 truck1)
   deleted: (at package7 s1)
   added: (in package7 truck1)
   goals met: 10 of 41
21. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 10 of 41
22. (drive-truck driver2 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 10 of 41
23. (unload-truck s3 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s3)
   goals met: 11 of 41
24. (load-truck s3 package23 truck1)
   deleted: (at package23 s3)
   added: (in package23 truck1)
   goals met: 11 of 41
25. (drive-truck driver2 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 11 of 41
26. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 11 of 41
27. (load-truck s2 package6 truck1)
   deleted: (at package6 s2)
   added: (in package6 truck1)
   goals met: 11 of 41
28. (load-truck s2 package34 truck1)
   deleted: (at package34 s2)
   added: (in package34 truck1)
   goals met: 11 of 41
29. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 11 of 41
30. (load-truck s0 package29 truck1)
   deleted: (at package29 s0)
   added: (in package29 truck1)
   goals met: 11 of 41
31. (drive-truck driver2 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 11 of 41
32. (unload-truck s3 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s3)
   goals met: 12 of 41
33. (load-truck s3 package22 truck1)
   deleted: (at package22 s3)
   added: (in package22 truck1)
   goals met: 12 of 41
34. (drive-truck driver2 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 12 of 41
35. (load-truck s0 package13 truck1)
   deleted: (at package13 s0)
   added: (in package13 truck1)
   goals met: 12 of 41
36. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 12 of 41
37. (load-truck s2 package32 truck1)
   deleted: (at package32 s2)
   added: (in package32 truck1)
   goals met: 12 of 41
38. (drive-truck driver2 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 12 of 41
39. (unload-truck s3 package32 truck1)
   deleted: (in package32 truck1)
   added: (at package32 s3)
   goals met: 13 of 41
40. (load-truck s3 package20 truck1)
   deleted: (at package20 s3)
   added: (in package20 truck1)
   goals met: 13 of 41
41. (drive-truck driver2 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 13 of 41
42. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 13 of 41
43. (unload-truck s1 package34 truck1)
   deleted: (in package34 truck1)
   added: (at package34 s1)
   goals met: 14 of 41
44. (unload-truck s1 package30 truck1)
   deleted: (in package30 truck1)
   added: (at package30 s1)
   goals met: 15 of 41
45. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 15 of 41
46. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 15 of 41
47. (unload-truck s2 package29 truck1)
   deleted: (in package29 truck1)
   added: (at package29 s2)
   goals met: 16 of 41
48. (unload-truck s2 package27 truck1)
   deleted: (in package27 truck1)
   added: (at package27 s2)
   goals met: 17 of 41
49. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 17 of 41
50. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 17 of 41
51. (unload-truck s1 package28 truck1)
   deleted: (in package28 truck1)
   added: (at package28 s1)
   goals met: 18 of 41
52. (unload-truck s1 package24 truck1)
   deleted: (in package24 truck1)
   added: (at package24 s1)
   goals met: 19 of 41
53. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 19 of 41
54. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 19 of 41
55. (load-truck s2 package25 truck1)
   deleted: (at package25 s2)
   added: (in package25 truck1)
   goals met: 19 of 41
56. (unload-truck s2 package23 truck1)
   deleted: (in package23 truck1)
   added: (at package23 s2)
   goals met: 20 of 41
57. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 20 of 41
58. (load-truck s0 package12 truck1)
   deleted: (at package12 s0)
   added: (in package12 truck1)
   goals met: 20 of 41
59. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 20 of 41
60. (load-truck s2 package2 truck1)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   goals met: 20 of 41
61. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 20 of 41
62. (unload-truck s0 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   goals met: 21 of 41
63. (drive-truck driver2 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 21 of 41
64. (unload-truck s3 package25 truck1)
   deleted: (in package25 truck1)
   added: (at package25 s3)
   goals met: 22 of 41
65. (load-truck s3 package17 truck1)
   deleted: (at package17 s3)
   added: (in package17 truck1)
   goals met: 22 of 41
66. (drive-truck driver2 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 22 of 41
67. (unload-truck s0 package17 truck1)
   deleted: (in package17 truck1)
   added: (at package17 s0)
   goals met: 23 of 41
68. (load-truck s0 package11 truck1)
   deleted: (at package11 s0)
   added: (in package11 truck1)
   goals met: 23 of 41
69. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 23 of 41
70. (unload-truck s1 package22 truck1)
   deleted: (in package22 truck1)
   added: (at package22 s1)
   goals met: 24 of 41
71. (drive-truck driver2 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 24 of 41
72. (drive-truck driver2 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 24 of 41
73. (load-truck s2 package18 truck1)
   deleted: (at package18 s2)
   added: (in package18 truck1)
   goals met: 24 of 41
74. (drive-truck driver2 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 24 of 41
75. (unload-truck s3 package18 truck1)
   deleted: (in package18 truck1)
   added: (at package18 s3)
   goals met: 25 of 41
76. (load-truck s3 package14 truck1)
   deleted: (at package14 s3)
   added: (in package14 truck1)
   goals met: 25 of 41
77. (drive-truck driver2 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 25 of 41
78. (load-truck s2 package15 truck1)
   deleted: (at package15 s2)
   added: (in package15 truck1)
   goals met: 25 of 41
79. (unload-truck s2 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s2)
   goals met: 26 of 41
80. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 26 of 41
81. (unload-truck s0 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s0)
   goals met: 27 of 41
82. (load-truck s1 package10 truck5)
   deleted: (at package10 s1)
   added: (in package10 truck5)
   goals met: 27 of 41
83. (board-truck driver1 s1 truck5)
   deleted: (at driver1 s1) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 27 of 41
84. (load-truck s1 package19 truck5)
   deleted: (at package19 s1)
   added: (in package19 truck5)
   goals met: 27 of 41
85. (drive-truck driver1 s1 s3 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s3)
   goals met: 27 of 41
86. (unload-truck s3 package19 truck5)
   deleted: (in package19 truck5)
   added: (at package19 s3)
   goals met: 28 of 41
87. (drive-truck driver1 s3 s2 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   goals met: 28 of 41
88. (unload-truck s2 package10 truck5)
   deleted: (in package10 truck5)
   added: (at package10 s2)
   goals met: 29 of 41
89. (walk driver3 s3 p0-3)
   deleted: (at driver3 s3)
   added: (at driver3 p0-3)
   goals met: 29 of 41
90. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 29 of 41
91. (unload-truck s2 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s2)
   goals met: 30 of 41
92. (drive-truck driver2 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 30 of 41
93. (unload-truck s3 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s3)
   goals met: 31 of 41
94. (drive-truck driver2 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 31 of 41
95. (unload-truck s1 package20 truck1)
   deleted: (in package20 truck1)
   added: (at package20 s1)
   goals met: 32 of 41
96. (walk driver3 p0-3 s0)
   deleted: (at driver3 p0-3)
   added: (at driver3 s0)
   goals met: 33 of 41
97. (walk driver4 s2 p1-2)
   deleted: (at driver4 s2)
   added: (at driver4 p1-2)
   goals met: 33 of 41
98. (drive-truck driver2 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 33 of 41
99. (drive-truck driver2 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 33 of 41
100. (unload-truck s2 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s2)
   goals met: 34 of 41
101. (walk driver4 p1-2 s1)
   deleted: (at driver4 p1-2)
   added: (at driver4 s1)
   goals met: 35 of 41
102. (walk driver6 s3 p0-3)
   deleted: (at driver6 s3)
   added: (at driver6 p0-3)
   goals met: 35 of 41
103. (walk driver6 p0-3 s0)
   deleted: (at driver6 p0-3)
   added: (at driver6 s0)
   goals met: 36 of 41
104. (board-truck driver5 s2 truck6)
   deleted: (at driver5 s2) (empty truck6)
   added: (driving driver5 truck6)
   goals met: 36 of 41
105. (disembark-truck driver1 s2 truck5)
   deleted: (driving driver1 truck5)
   added: (at driver1 s2) (empty truck5)
   goals met: 36 of 41
106. (drive-truck driver5 s2 s0 truck6)
   deleted: (at truck6 s2)
   added: (at truck6 s0)
   goals met: 37 of 41
107. (board-truck driver4 s1 truck3)
   deleted: (at driver4 s1) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 36 of 41
108. (drive-truck driver4 s1 s3 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   goals met: 37 of 41
109. (disembark-truck driver4 s3 truck3)
   deleted: (driving driver4 truck3)
   added: (at driver4 s3) (empty truck3)
   goals met: 37 of 41
110. (board-truck driver7 s3 truck3)
   deleted: (at driver7 s3) (empty truck3)
   added: (driving driver7 truck3)
   goals met: 37 of 41
111. (drive-truck driver7 s3 s2 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   goals met: 36 of 41
112. (walk driver4 s3 p0-3)
   deleted: (at driver4 s3)
   added: (at driver4 p0-3)
   goals met: 36 of 41
113. (walk driver4 p0-3 s0)
   deleted: (at driver4 p0-3)
   added: (at driver4 s0)
   goals met: 36 of 41
114. (disembark-truck driver7 s2 truck3)
   deleted: (driving driver7 truck3)
   added: (at driver7 s2) (empty truck3)
   goals met: 37 of 41
115. (board-truck driver7 s2 truck2)
   deleted: (at driver7 s2) (empty truck2)
   added: (driving driver7 truck2)
   goals met: 36 of 41
116. (board-truck driver1 s2 truck3)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 36 of 41
117. (drive-truck driver1 s2 s3 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   goals met: 37 of 41
118. (drive-truck driver7 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 37 of 41
119. (drive-truck driver7 s3 s1 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   goals met: 38 of 41
120. (disembark-truck driver7 s1 truck2)
   deleted: (driving driver7 truck2)
   added: (at driver7 s1) (empty truck2)
   goals met: 38 of 41
121. (board-truck driver4 s0 truck4)
   deleted: (at driver4 s0) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 38 of 41
122. (drive-truck driver4 s0 s1 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 39 of 41
123. (disembark-truck driver4 s1 truck4)
   deleted: (driving driver4 truck4)
   added: (at driver4 s1) (empty truck4)
   goals met: 40 of 41
124. (walk driver7 s1 p1-2)
   deleted: (at driver7 s1)
   added: (at driver7 p1-2)
   goals met: 40 of 41
125. (walk driver7 p1-2 s2)
   deleted: (at driver7 p1-2)
   added: (at driver7 s2)
   goals met: 41 of 41
